## staging: ecs
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`


**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 2 to add, 2 to change, 2 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.masked_server_metrics_etl.aws_cloudwatch_event_rule.event_rule will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "event_rule" {
        id                  = "masked_server_metrics_event_rule"
        name                = "masked_server_metrics_event_rule"
      ~ schedule_expression = "rate(1 minute)" -> "rate(24 hours)"
        tags                = {
            "Name" = "masked_server_metrics-cw-event-rule"
        }
        # (4 unchanged attributes hidden)
    }

  # module.masked_server_metrics_etl.aws_cloudwatch_event_target.ecs_scheduled_task will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
        id             = "masked_server_metrics_event_rule-terraform-20210702182404782300000005"
      - input          = jsonencode({}) -> null
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.masked_server_metrics_etl.aws_ecs_task_definition.task_def must be replaced
-/+ resource "aws_ecs_task_definition" "task_def" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:005133826942:task-definition/masked_server_metrics:6" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  ~ environment      = [
                        # (2 unchanged elements hidden)
                        {
                            name  = "MASK_DATA"
                            value = "True"
                        },
                      + {
                          + name  = "SERVER_EVENTS_ENDPOINT"
                          + value = "https://retrieval.wild-samphire.cdssandbox.xyz/events"
                        },
                    ]
                    # (10 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "masked_server_metrics" -> (known after apply)
      ~ revision                 = 6 -> (known after apply)
        tags                     = {
            "CostCentre" = "CovidShield"
        }
        # (8 unchanged attributes hidden)
    }

  # module.unmasked_server_metrics_etl.aws_ecs_task_definition.task_def must be replaced
-/+ resource "aws_ecs_task_definition" "task_def" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:005133826942:task-definition/unmasked_server_metrics:6" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  ~ environment      = [
                        # (2 unchanged elements hidden)
                        {
                            name  = "MASK_DATA"
                            value = "False"
                        },
                      + {
                          + name  = "SERVER_EVENTS_ENDPOINT"
                          + value = "https://retrieval.wild-samphire.cdssandbox.xyz/events"
                        },
                    ]
                    # (10 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "unmasked_server_metrics" -> (known after apply)
      ~ revision                 = 6 -> (known after apply)
        tags                     = {
            "CostCentre" = "CovidShield"
        }
        # (8 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"


```

</details>